<?php
/**
 * Russian language file
 *
 * @package Language
 * @author  Konstantin Boudnik <cos@guard.dhs.org>
 * @author  Eugene Surov <gene@base3.it>
 * @author  Hal De <hal@halsbox.ru>
 * @version $Id: ru.php,v 2.11 2009/04/05 22:19:13 andig2 Exp $
 */

$lang[encoding]            = "utf-8";

$lang[audiocodec]          = "Кодек звука";
$lang[borrowto]            = "Выдано";
$lang[cast]                = "В ролях";
$lang[country]             = "Страна";
$lang[coverurl]            = "URL Обложки";
$lang[dimension]           = "Разрешение";
$lang[director]            = "Режиссер";
$lang[diskid]              = "ID диска";
$lang[filedate]            = "Дата файла";
$lang[filename]            = "Имя файла";
$lang[filesize]            = "Размер файла";
$lang[genre]               = "Жанр";
$lang[genres]              = "Жанры";
$lang[keywords]            = "Ключевые слова";
$lang[language]            = "Язык";
$lang[length]              = "Продолжительность";
$lang[less]                = "Меньше";
$lang[more]                = "Больше";
$lang[plot]                = "Содержание";
$lang[runtime]             = "Продолжительность";
$lang[subtitle]            = "Альт. название";
$lang[title]               = "Название";
$lang[tvepisode]           = "ТВ-эпизод";
$lang[seen]                = "Смотрел";
$lang[videocodec]          = "Codec видео";
$lang[year]                = "Год выпуска";
$lang[yes]                 = "Да";
$lang[comment]             = "Комментарий";
$lang[mediatype]           = "Тип носителя";
$lang[save]                = "Сохранить";
$lang[back]                = "Назад";
$lang[coverupload]         = "Загрузить обложку";
$lang[visit]               = "Посетить";
$lang[date]                = "Дата";
$lang[fetchtime]           = "Время закачки";
$lang[cachesize]           = "Размер кэша";
$lang[cacheexpired]        = "Просрочен";
$lang[cachecleanup]        = "Почистить кэш";
$lang[cacheempty]          = "Опустошить кэш";
$lang[okay]                = "Ok";
$lang[asactor]             = "в роли";
$lang[displayed]           = "показан";
$lang[add_another]         = "Добавить";
$lang[rating]              = 'Рейтинг';
$lang[extid]                = 'Внешний Id';

$lang[purchase]             = 'Купить';
$lang[torrents]             = 'Торренты';

#
#Multiuser
#

$lang[enterusername]       = "Введите свое имя и пароль для продолжения.";
$lang[stayloggedin]        = "Сохранять вход с этого компьютера";
$lang[login]               = "Вход";
$lang[logout]              = "Выход";
$lang[owner]               = "Владелец";
$lang[loggedinas]          = "Вы зашли как";

$lang[username]            = "Имя";
$lang[password]            = "Пароль";
$lang[permissions]         = "Привилегии";
$lang[perm_admin]          = "Администрирование";
$lang[perm_readall]        = "Смотреть фильмы других владельцев";
$lang[perm_writeall]       = "Изменять фильмы других владельцев";
$lang[perm_write]          = "Изменять собственные фильмы";
$lang[perm_adult]          = "Просмотр фильмов для взрослых";
$lang[write]               = "Изменять фильмы";
$lang[read]                = "Смотреть фильмы";
$lang[update]              = "обновить";
$lang[create]              = "создать";
$lang[existingusers]       = "Существующие пользователи";
$lang[permforuser]         = "Привилегии пользователя";
$lang[createuser]          = "Создать нового пользователя";
$lang[email]               = "E-Mail";
$lang[borrowask]           = "Попросить на время";

$lang[msg_usercreated]     = "Пользователь создан";
$lang[msg_permpassupd]     = "Обновить привилегии и пароль";
$lang[msg_permupd]         = "Привилегии обновлены";
$lang[msg_userdel]         = "Пользователь удален";
$lang[msg_loggedoff]       = "Вы были отключены";
$lang[msg_invalidchar]     = "Недопустимый символ в имени пользователя";
$lang[msg_loginfailed]     = "Войти в систему не удалось";
$lang[msg_borrowasksubject]= "[VideoDB] Запрос на выдачу %title%";
$lang[msg_borrowaskmail]   = "Пользователь %user% (%usermail%) запросил у Вас фильм \"%title%\" для просмотра (ID диска %diskid%).\n\nVideo-URL: %url%\n\n\n\n-- \Сообщение послано VideoDB";
$lang[msg_borrowaskok]     = "Ваш запрос был послан владельцу фильма. Вскоре Вы получите ответ.";
$lang[msg_borrowaskfail]   = "Отправка Вашего запроса по какой-то причине не удалась. Попробуйте обратиться к владельцу интересуюшего Вас фильма самостоятельно.";

#
# Phrases
#

$lang[available]           = "в наличии.";
$lang[deleted]             = "Фильм был удален.";
$lang[genre_desc]          = "Искать фильмы только в этих жанрах (OR конкатенация)";
$lang[keywords_desc]       = "Поиск ключевых слов осуществляется в следующих полях: Название, Субтитры, Режиссер, Содержание и В ролях. В запросе можно использовать операции AND, NOT и OR.";
$lang[lentto]              = "выдано";
$lang[listallfiles]        = "список всех файлов";
$lang[look_imdb]           = "искать недостающие данные на IMDB";
$lang[really_del]          = "Действительно удалять";
$lang[returned]            = "Возвращено";
$lang[notavail]            = "<span class=\"notavail\">НЕ ДОСТУПНО</span><br />не доступно";
$lang[curlent]             = "В настоящий момент на руках:";
$lang[curlentfrom]         = "В настоящий момент не у владельца";
$lang[fieldselect]         = "Искать только в этих полях";
$lang[selectall]           = "Выбрать все";

#
# Menue
#

$lang[browse]              = "Просмотр";
$lang[borrow]              = "Выдать";
$lang[del]                 = "Удалить";
$lang[edit]                = "Редактировать";
$lang[perm]                = "Привилегии";
$lang[copy]                = "Скопировать";
$lang[n_e_w]               = "Добавить";
$lang[random]              = "Случайный выбор";
$lang[search]              = "Поиск";
$lang[statistics]          = "Статистика";
$lang[view]                = "Посмотреть";
$lang[setup]               = "Конфигурация";
$lang[tools]               = "Дополнения";
$lang[contrib]             = "Дополнения";
$lang[imdbbrowser]         = "Подключиться к IMDB";
$lang[help]                = "Помощь";
$lang[searchimdb]          = "Поиск в IMDB";
$lang[profile]             = "Выбор настроек";

#
# Radio-Buttons
#

$lang[radio_all]           = "все";
$lang[radio_new]           = "новый";
$lang[radio_showtv]        = "показать ТВ-эпизоды";
$lang[radio_unseen]        = "не смотрел";
$lang[radio_wanted]        = "Список желаемых фильмов";

$lang[radio_look_ignore]   = "игнориравать";
$lang[radio_look_lookup]   = "добавить пропущенное";
$lang[radio_look_overwrite]= "переписать";
$lang[radio_look_caption]  = "Поиск данных";

$lang[quicksearch]         = "Быстрый поиск";
$lang[working]             = "В процессе...";

$lang[filter_any]          = '<любой>';
$lang[filter_available]    = '<доступный>';

#
# Trailers
#

$lang[trailer_search]      = "Поиск трейлера...";
$lang[trailer_show]        = "Показать трейлеры";

#
# Statistics
#

$lang[averagefilesize]     = "средний размер файла";
$lang[averageruntime]      = "средняя продолжительность";
$lang[languages]           = "Языки";
$lang[multiple]            = "<small>(возможно несколько жанров<br />для одного фильма)</small>";
$lang[numberdisks]         = "количество дисков";
$lang[totalfiles]          = "всего файлов";
$lang[totalruntime]        = "общая продолжительность";
$lang[totalseen]           = "всего просмотрено";
$lang[totalsize]           = "общий размер";
$lang[tv_episodes]         = "ТВ-эпизодов";
$lang[videobygen]          = "Фильмы по жанрам";
$lang[videobyvcodec]       = "Кодеки видео";
$lang[videobyacodec]       = "Кодеки аудио";
$lang[videobymedia]        = "Типы носителей";

#
# Lookup Popup
#

$lang[l_search]            = "Поиск";
$lang[l_select]            = "Выбрать совпавшее название:";
$lang[l_nothing]           = "Ничего не найдено.";
$lang[l_selfsearch]        = "Самостоятельный поиск";
$lang[aka]                 = "Aka";

#
#Config Help
#

$lang[opt_general]          = 'Основное';
$lang[opt_custom]           = 'Пользовательские поля';
$lang[opt_engines]          = 'Источники данных';
$lang[opt_security]         = 'Сеть и безопасность';
$lang[opt_caching]          = 'Кэширование';
$lang[opt_apikeys]          = 'Ключи API';


$lang[enable]              = "разрешить";

$lang[help_langn]          = "Язык";
$lang[help_lang]           = "Выберите код страны. Если Ваш язык отсутствует - переведите файл английский файл из каталога <span class=\"example\">language</span> и пошлите мне.";
$lang[help_autoidn]        = "Авто-DiskID";
$lang[help_autoid]         = "VideoDB использует ID дисков для их идентификации. Это поле отличается от автоматически назначаемого программой номера для каждой записи о фильме. Данное поле облегчает хранение нескольких видео-роликов или фильмов на одном диске. Если Вы используете функцию \"Выдать\", чтобы отметить выданный взаймы диск, то все фильмы с такого диска будут одновременно помечены как недоступные.<br />Включение этой опции приведет к тому, что VideoDB будет автоматически увеличивать значение поля ID, если эта опция разрешена. Это удобно, если же Вы не используете сложную схему именования дисков Вашей фильмотеки и просто хотите нумеровать свои видео-диски.";
$lang[help_templaten]      = "Образец";
$lang[help_template]       = "Это набор интерфейсов VideoDB. Каждый образец может включать в себя несколько стилей (цветовых схем). Выберите наиболее понравившуюся :-)";
$lang[help_mediadefaultn]  = "Тип носителя по умолчанию";
$lang[help_mediadefault]   = "Устанавливает тип носителя для добавляемого фильма.";
$lang[help_langdefaultn]   = "Язык по умолчанию";
$lang[help_langdefault]    = "Эта опция используется для установки языка фильма при добавлении нового диска. Вы можете не изменять эту опцию.";
$lang[help_languageflagsn] = "Флаги";
$lang[help_languageflags]  = "Здесь можно выбрать флаги, которые появятся в программе как кнопки для быстрого выбора языка в форме редактирования.<br /> Не выбирайте больше 5 флагов одновременно.";
$lang[help_filterdefaultn] = "Фильтр по умолчанию";
$lang[help_filterdefault]  = "Это страница, которая будет показываться при запуске VideoDB";
$lang[help_showtvn]        = "Показывать ТВ-эпизоды";
$lang[help_showtv]         = "Если вы хотите показывать ТВ-эпизоды вместе с остальными фильмами - включите эту опцию";
$lang[help_orderallbydiskn]= "Сортировать по DiskID";
$lang[help_orderallbydisk] = "Если этот параметр разрешен, то список фильмов в категории \"все\" будет отсортирован по DiskID, а не по названию фильмов";
$lang[help_removearticlesn]= "Удалить артикли";
$lang[help_removearticles] = "Если выбрано - у добавляймых фильмов удаляются артикли, например The Angel сохраняется как Angel, The.";
$lang[help_customn]        = "Дополнительные поля";
$lang[help_custom]         = "Вы можете определить до четырех дополнительных полей для Ваших фильмов. Каждое может хранить до 255 символов. Здесь Вы можете присвоить имена для этих полей и выбрать обслуживающие программы, которые будут использоваться для отображения полей. Удалите имя обслуживающей программы, что запретить ее выполнение.";
$lang[help_localnetn]      = "Локальная сеть";
$lang[help_localnet]       = "Здесь Вы можете задать параметры Вашей локальной сети. Пользователи, присоединенные к VideoDB удаленно, не смогут редактировать список Ваших фильмов. <a href=\"http://www.php.net/manual/en/pcre.pattern.syntax.php\" target=\"_blank\">Вот здесь</a> вы можете найти правила построения регулярных выражений, позволяющие создавать довольно сложные описание Вашей локальной сети. <p>Примеры:<br/><span class=\"example\">^192\.168\.1\.</span> разрешает доступ для 192.168.1.1 - 192.168.1.254<br /><span class=\"example\">^(192\.168\.1\.|127\.0\.0\.1$)</span> то же, что и выше плюс компьютер, где установлена VideoDB (localhost)<br /><span class=\"example\">^192\.168\.1\.22$</span> разрешает доступ только для компьютера с адресом 192.168.1.22<br /><span class=\"example\">^(192\.168\.1\.22|127\.0\.0\.1)$</span> то же, что и выше плюс компьютер, где установлена VideoDB (localhost)<br /> пустое регулярное выражение разрешает доступ с редактированием для всех<br /></p> Предупреждение: если Вы сделаете ошибку в описании Вашей локальной сети, Вы можете отключиться от страницы конфигурации!";
$lang[help_imdbOverwriten] = "Брать из IMDB";
$lang[help_imdbOverwrite]  = "IMDB-Просмотры по умолчанию не замещают существующие данные. Если вы разрешите эту опцию, VideoDB будет замещать уже введенные данные при IMDB-просмотре.";
$lang[help_IMDBagen]       = "продолжительность IMDB кэширования";
$lang[help_IMDBage]        = "VideoDB может хранить IMDB запросы, чтобы избежать излишних соединений с серверами IMDB и для снижения нагрузки. Вы можете определить максимальную продолжительность кэширования запросов (в секундах). По умолчанию это значение равняется пяти дням.";
$lang[help_thumbnailn]     = "Пиктограммы";
$lang[help_thumbnail]      = "Если Вы включите эту опцию, VideoDB будет показывать маленькие фотографии обложек фильмов при просмотре списка. Если эти фотографии мешают Вам или замедляют скорость работы системы - выключите эту возможность.";
$lang[help_castcolumnsn]   = "Форматирование списков ролей";
$lang[help_castcolumns]    = "Этот параметр определяет как много колонок будет использовано при просмотре информации о фильме, для отображения списка актеров. Это количество зависит от разрешения Вашего монитора. <br />Например, 2 колонки отлично выглядят на разрешении 1152x864. Для меньших разрешений имеет смысл использовать значение 1.";
$lang[help_listcolumnsn]   = "Список полей";
$lang[help_listcolumns]    = "Параметр используется только в стиле 'modern'. Он определяет сколько полей используется для показа списка фильмов. Если значение равно 1, то будет показан список аналогичный стилю по умолчанию.";
$lang[help_recompilen]     = "Принудительная перекомпиляции";
$lang[help_recompile]      = "Программа компилирует образцы только один раз и затем использует только компилированные версии. Установка режима принудительной компиляции имеет смысл, если в разрабатываете Ваш собственные образец или что-то меняете в коде программы.";
$lang[help_proxy_hostn]    = "Сервер-посредник (proxy)";
$lang[help_proxy_host]     = "Если база VideoDB находится за системой сетевой защиты firewall, здесь Вы можете указать имя сервера-посредника (proxy). Оставьте поле пустым, если Вы не нуждаетесь в использовании сервера-посредника.";
$lang[help_proxy_portn]    = "Порт сервера-посредника";
$lang[help_proxy_port]     = "Укажите номер порта Вашего сервера-посредника. <span class=\"например\">8080</span>.";
$lang[help_actorpicsn]     = "Загрузка пиктограмм актеров";
$lang[help_actorpics]      = "Это позволит Вам расположить маленькую фотографию актера после имени. <br />Это только экспериментальная возможность - отключите ее в случае каких-либо проблем.";
$lang[help_thumbAgen]      = "Повтор загрузки пиктограмм актеров";
$lang[help_thumbAge]       = "Это поле определяет время повтора загрузки пиктограмм актеров. По умолчанию, повторная попытка будет осуществляться раз в три недели.";
$lang[help_youtubekeyn]    = "YouTube API ключ";
$lang[help_youtubekey]     = "Чтобы включить поддержку Youtube, получите YouTube developer API key с <a href='http://www.youtube.com/my_profile_dev'>http://www.youtube.com/my_profile_dev</a>.";
$lang[help_shownewn]       = "Новые фильмы";
$lang[help_shownew]        = "Здесь можно задать количество показываемых фильмов в фильтре \"новые\"";
$lang[help_imdbBrowsern]   = "Просмотр IMDB";
$lang[help_imdbBrowser]    = "Эта функция позволит просматривать содержание IBDM при помощи VideoDB и добавлять фильмы непосредственно с IMDB сервера";

$lang[help_multiuser]      = "Эта функция разрешает использование многопользовательского режима с идентификацией при помощи паролей";
$lang[help_multiusern]     = "Поддержка многопользовательского режима";
$lang[help_usermanager]    = "В многопользовательском режиме используйте эту ссылку для добавления, изменения и/или удаления пользователей и их привилегий.";
$lang[help_usermanagern]   = "Управление пользователями";
$lang[help_permmanager]    = "По этой ссылке можно изменить привилегии пользователей.";
$lang[help_permmanagern]   = "Управление привилегиями";
$lang[help_denyguest]      = "Включение этой функции запрещает доступ к VideoDB всем, кроме зарегистрированных пользователей. (Используется только с разрешенным многопользовательским режимом)";
$lang[help_denyguestn]     = "Доступ без авторизации запрещен";
$lang[help_adultgenres]    = "Фильмы этого жанра могут быть доступны только пользователям с правом доступа 'adult' (для взрослых). Удерживая кнопку CTRL, Вы можете выбрать несколько жанров. (Возможность работает только в много-пользовательском режиме)";
$lang[help_adultgenresn]   = "Жанры фильмов для взрослых";
$lang[help_pageno]   	   = "Количество пунктов, показываемых на каждой странице. Испльзуйте 0 или пустой поле для запрещения разбивки на страницы.";
$lang[help_pagenon]        = "Максимальное количество пунктов на странице.";

$lang[help_engine]         = "Включение этой опции позволит videoDB получать данные с %s.";
$lang[help_defaultenginen] = "Источник данных по умолчанию";
$lang[help_defaultengine]  = "Выберите откуда videoDB будет получать данные по умолчанию.";
$lang[help_enginegoogle]   = "Google поддерживает только поиск изображений.";
$lang[help_engexperimental]= "<br/>Внимание! Этот источник данных работает в экспериментальном режиме и может работать неправильно.";

$lang[help_showtoolsn]     = "Показывать дополнения";
$lang[help_showtools]      = "Меню дополнений показывает скрипты из папки <code>contrib</code>. Эти скрипты - полезные дополнения к videoDB, но они не до конца протестированы и могут повлиять на безопасность.";

$lang[page]                = "Страница";
$lang[of]                  = " ";
$lang[records]             = "записей";

$lang[warn_noOwner]        = "Данные не сохранены, вы должны сперва выбрать владельца!";

?>
